app/controllers/photos_controller.rb

INSERT INTO `photos` (`created_at`, `image_file_name`, `photo_title`, `photo_taken_with`, `image_file_size`, `updated_at`, `post_id`, `image_content_type`, `photo_taken_on`, `image_updated_at`) VALUES('2010-09-29 10:10:11', 'P1000021.JPG', 'This is the title', '', 2247578, '2010-09-29 10:10:11', NULL, 'image/jpeg', NULL, '2010-09-29 10:10:11')
---
  def create
    @photo = Photo.new(params[:photo])
    if @photo.save

SELECT * FROM `photos` WHERE (`photos`.`id` = 5)
---
  def show
    @user = current_user
  @photo = Photo.find(params[:id])

SELECT * FROM `photos` WHERE (`photos`.`id` = 7)
DELETE FROM `photos` WHERE `id` = 7
---
  def destroy
    @user = current_user
    @photo = Photo.find(params[:id])
    if @photo.destroy