app/controllers/posts_controller.rb

  def create
    @post =  Post.new(params[:post])
    photo = Photo.new(params[:photo])
    @post.user = current_user
    @post.photos << photo
---
INSERT INTO `photos` (`created_at`, `image_file_name`, `photo_title`, `photo_taken_with`, `image_file_size`, `updated_at`, `post_id`, `image_content_type`, `photo_taken_on`, `image_updated_at`) VALUES('2010-10-02 19:19:02', 'P1000021.JPG', 'My Room', 'Nikon CoolPix', 2247578, '2010-10-02 19:19:02', 1, 'image/jpeg', '2010-10-02 00:00:00', '2010-10-02 19:19:00')
INSERT INTO `posts` (`created_at`, `title`, `updated_at`, `user_id`, `type`) VALUES('2010-10-02 19:19:02', 'My Room', '2010-10-02 19:19:02', 26, NULL)

  def update
    @post = Post.find(params[:id])
    photo = @post.photos.last
    if @post.update_post(params)
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `photos` WHERE (`photos`.post_id = 1) ORDER BY photos.id DESC LIMIT 1
UPDATE `photos` SET `updated_at` = '2010-10-02 22:20:48', `photo_taken_with` = 'Cannon EasyShare', `photo_title` = 'My Room at Brookes' WHERE `id` = 7
UPDATE `posts` SET `updated_at` = '2010-10-02 22:14:14', `title` = 'My Room updated title' WHERE `id` = 1

  def destroy
    @post =  Post.find(params[:id])
    if @post.destroy
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 132)
DELETE FROM `posts` WHERE `id` = 122