app/controllers/user_sessions_controller.rb

  def create
    user_session = UserSession.new(params[:user_session])
    if user_session.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `perishable_token`, `username`, `failed_login_count`, `current_login_ip`, `password_salt`, `last_name`, `persistence_token`, `login_count`, `activated`, `last_login_at`, `first_name`, `email`) VALUES('2010-09-29 06:10:13', '52aa320491b518130dba91e5d122d98630fe605e3e73690b9cd12657043cf8860ebb0b52e26ced04c32042ac17b35d7f58556406042bad75024f4723590f7d1e', '2010-09-29 06:10:13', 'IqN4FkyK2VFl3gVz4XBT', 'siddharth', NULL, NULL, '_5_lbyKv-TCXvlo_ykKx', NULL, '68812573ad77c2dcad62d2a371082748f17e8327a22d144e83245d28083bd8d2e6b0185957b47d6d37e6d4bf2746bd7e6994cb42482bbe2f58aa0265778661ed', NULL, 0, NULL, NULL, 'sid@trashmail.com')