app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `perishable_token`, `username`, `failed_login_count`, `current_login_ip`, `password_salt`, `last_name`, `persistence_token`, `login_count`, `activated`, `last_login_at`, `first_name`, `email`) VALUES('2010-09-28 11:55:36', '0cdcc9a63f596f12054f3d08d634ccc8f3a04f3876b922acad7beb8c692ec4653ce52d267ea6a9f97ac0409c10ff083931ba02ec45246b8d6752b60eb30d8929', '2010-09-28 11:55:36', 'hVGM9j6VsKtEO_4WZ3G_', 'gupperson', NULL, NULL, '478wR7LjIsHxOm_5X5j6', NULL, '5b0e561bfc97609c6080055597ae1ce13389961c3a4f56ff24292c0056a39d4ae25f3105bee808c54324a98a4c580101bbf3019942ab844554eb20faff03d68a', NULL, 0, NULL, NULL, 'nandi.priyanka@gmail.com')

  def activate
    @user = User.find_by_perishable_token(params[:id])
    if @user
      @user.activate
      if @user.save
---
SELECT `users`.id FROM `users` WHERE (`users`.`perishable_token` = BINARY 'MrOA-GLNGF3D1s6etgFV' AND `users`.id <> 26) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-09-28 12:34:47', `perishable_token` = 'rOsFausN4baLcQf23mHu', `activated` = 1 WHERE `id` = 23